-- SCOTT --
VIEW(뷰)
- 생성
CREATE VIEW 뷰이름
CREATE OR REPLACE VIEW 뷰이름( 없으면생성, 있으면 수정 )
CREATE OR REPLACE FORCE VIEW 뷰이름 : 기본테이블의 유무에 상관없이 뷰 생성
CREATE OR REPLACE NOFORCE VIEW 뷰이름 : 기본테이블이 있을 때만 뷰 생성
-- 기존 테이블에서 쿼리 실행 (뷰에서 사용할 서브쿼리)
;
-- JOIN
SELECT b.b_id, title, price, g.g_id, g_name, p_date, p_su
FROM book b JOIN danga d ON b.b_id = d.b_id
            JOIN panmai p ON b.b_id = p.b_id
            JOIN gogaek g ON p.g_id = g.g_id;
-- 쿼리실행과정 이해 -- 뷰 : 쿼리를 미리 메모리에 올려놓는것. 처리속도 빨라짐
CREATE OR REPLACE VIEW uvpan
    -- 칼럼명 그대로 사용
AS 
SELECT b.b_id, title, price, g.g_id, g_name, p_date, p_su* price amt
FROM book b JOIN danga d ON b.b_id = d.b_id
            JOIN panmai p ON b.b_id = p.b_id
            JOIN gogaek g ON p.g_id = g.g_id;
-- ORA-01031: insufficient privileges
-- 권한 확인
select *
from user_sys_privs;

-- view 사용
select *
from uvpan -- 뷰
where b_id = 'a-1'
ORDER by p_date; 
from 테이블명 또는 뷰명

-- 모든 뷰를 조회
select *
from user_views;
from user_users
from user_constraints;
from user_tables;

-- 뷰 삭제
DROP VIEW 이름;

-- [문제] 년도, 월, 고객코드, 고객명, 판매금액합
--      년도, 월 오름차순 정렬
--      uvgogaek 뷰를 생성하고 확인

CREATE OR REPLACE VIEW uvgogaek
AS
select to_char( p_date, 'YYYY' )p_year
        , to_char( p_date, 'MM')p_month
        , g.g_id, g_name,Sum( price*p_su) 판매금액합
FROm panmai p JOIN gogaek g on p.g_id = g.g_id
              JOIN danga d on p.b_id = d.b_id
GROUP by to_char( p_date, 'YYYY' )
        , to_char( p_date, 'MM')
        , g.g_id, g_name
ORDER BY p_year, p_month;

-- view 구조 확인
DESC uvgogaek; -- like table, 제약조건도 추가 가능
-- [ 물리적 뷰 ] 물리적으로 실제 데이터를 가지고 있는 뷰

-- 뷰
    ㄴ 단순뷰 - 1개 테이블         -- DML ( insert, update, delete)
    ㄴ 복합뷰 - 2개 이상의 테이블
    
CREATE TABLE testa (
   aid     NUMBER                  PRIMARY KEY
    ,name   VARCHAR2(20) NOT NULL
    ,tel    VARCHAR2(20) NOT NULL
    ,memo   VARCHAR2(100)
);

CREATE TABLE testb (
    bid NUMBER PRIMARY KEY
    ,aid NUMBER CONSTRAINT fk_testb_aid 
            REFERENCES testa(aid)
            ON DELETE CASCADE
    ,score NUMBER(3)
);  

INSERT INTO testa (aid, NAME, tel) VALUES (1, 'a', '1');
INSERT INTO testa (aid, name, tel) VALUES (2, 'b', '2');
INSERT INTO testa (aid, name, tel) VALUES (3, 'c', '3');
INSERT INTO testa (aid, name, tel) VALUES (4, 'd', '4');

INSERT INTO testb (bid, aid, score) VALUES (1, 1, 80);
INSERT INTO testb (bid, aid, score) VALUES (2, 2, 70);
INSERT INTO testb (bid, aid, score) VALUES (3, 3, 90);
INSERT INTO testb (bid, aid, score) VALUES (4, 4, 100);

COMMIT;
--
SELECT * FROM testa;
SELECT * FROM testB;

-- SIMPLE VIEW (단순 뷰) : 테이블 하나 
create or replace view aView
AS
select aid, name, tel
from testa;
-- 단순 뷰를 사용해서 insert
insert into aview (aid, name, tel) values (5, 'f', '5');
commit;
select * from aview;

-- SIMPLE VIEW (단순 뷰) : 수정
create or replace view aView
AS
select aid, name, memo
from testa;
--
insert into aview (aid, name, memo) values (6, 'g', null);
-- ORA-01400: cannot insert NULL into ("SCOTT"."TESTA"."TEL") 
-- ㄴ tel -> not null. (필수입력항목) 얘 없으면 insert 불가

-- 단순뷰 삭제
DELETE FROM aview
WHERE aid = 5;
select *
from aview;

rollback;

-- 단순뷰 수정
update aview 
set tel = '55' --SQL 오류: ORA-00904: "TEL": invalid identifier
--set memo =  'up'
WHERE aid= 5;

rollback;

drop view aview;

-- 복합뷰 생성 - DML 작업
create or replace view abview
AS
    select a.aid, name, tel -- testa 기존테이블의 칼럼
            ,bid, score -- testb 기존테이블의 컬럼
    from testa a join testb b on a.aid = b.aid
    with read only;
    
-- 
select *
from abview;

-- insert
insert into abview ( aid, name, tel, bid, score)
    values (10, 'x', 55, 20, 70 );
--SQL 오류: ORA-01779: cannot modify a column which maps to a non key-preserved table
-- 뷰를 사용해서 동시에 두개의 테이블에 insert, update 작업은 할 수 없다.
-- 단) 한 개의 테이블에 insert, update, 작업은 가능하다. 
--insert into abview ( aid, name, tel)
--    values (10, 'x', 55);
update abview
set score= 99
where bid =1;
commit;

select * from abview;

delete from abview
where aid = 2;
--SQL 오류: ORA-42399: cannot perform a DML operation on a read-only view
-- 읽기 전용의 뷰
commit;

-- [WITH CHECK OPTION 설명 ]
--   ㄴ 뷰에 의해 access될 수 있는 행(row)만이 삽입, 수정 가능
-- testb 테이블에서 score가 90점 이상인 결과만을 가지는 뷰를 생성
select * from testb;

CREATE OR REPLace view bview
as 
    select bid, aid, score
    from testb
    where score >= 90;

select * from bview;
-- bView 뷰를 사용해서 bid = 3    score = 70 수정
update bview
set score = 70
where bid = 3;

rollback;

CREATE OR REPLace view bview
as 
    select bid, aid, score
    from testb
    where score >= 90
    WITH CHECK OPTION CONSTRAINT CK_bView_score;
-- SQL 오류: ORA-01402: view WITH CHECK OPTION where-clause violation

drop view bview;
drop table testa;
drop table testb; -- 자식 먼저 삭제

-- MATERIALIZED VIEW (물리적 뷰)

--------------------------------------------------------------------------------
--[ DB(데이터 베이스) 모델링 ]
1. 데이터베이스 (Database) ? 서로 관련된 데이터의 모임(집합)
2. DB 모델링? 현실 세계의 업무적인 프로세스를 물리적으로 DB화 시키는 과정
    예) 현실 세계의 업무적인 프로세스
        ( 스타벅스에서 음료 주문 )
        음료(상품) 검색 -> 주문 -> 결재 -> 대기 -> 상품 픽업
3. DB 모델링 과정 (단계, 순서)

    1) 업무 프로세스          → 2) 개념적 DB 모델링
    ( 요구분석서 작성 )            (ERD entity relation diagram) 작성: eXERD툴
         ↑ 일치성 검토, 테스트               ↓
    4) 물리적 DB 모델링       ←   3) 논리적 DB 모델링
       DBMS (오라클..등)             ( 스키마, 정규화 과정 )
       데이터 타입, 크기 등
       인덱서
       역정규화
       등 

4. 프로젝트 진행 과정
 ※ 계획 → 분석 → 설계 → 구현 → 테스트 → 유지보수
( 1년 프로젝트 중 DataBase 모델링 6개월 정도 소요됨. ) 많은 비중 차지함

--------------------------------------------------------------------------------
5. DB 모델링 단계 ( 1 ) 업무 프로세스 분석 -> [ 요구사항명세서(분석서)] 작성
   1) 관련 분야에 대한 기본 지식과 상식 필요. (교육)
   2) 신입 사원의 입장에서 업무 자체와 프로세스 파악, 분석 필요
   3) 실제 문서 (서류, 장표, 보고서 등)를 수집하고 분석. 
   4) 담당자 인터뷰, 설문 조사 등 요구사항 직접 수렴. 
   5) 비슷한 업무 처리하는 DB 모델링 분석. 
   6) 백그라운드 프로세스 파악
   7) 사용자와의 요구 분석
   등 
   https://terms.naver.com/entry.naver?docId=3431222&ref=y&cid=58430&categoryId=58430
   한빛 마트의 데이터베이스를 위한 요구 사항 명세서
① 한빛 마트에 회원으로 가입하려면 회원아이디, 비밀번호, 이름, 나이, 직업을 입력해야 한다. -- 이유
② 가입한 회원에게는 등급과 적립금이 부여된다.
③ 회원은 회원아이디로 식별한다. (고유키, 식별자)

④ 상품에 대한 상품번호, 상품명, 재고량, 단가 정보를 유지해야 한다.(데이터로 관리)
⑤ 상품은 상품번호로 식별한다.

⑥ 회원은 여러 상품을 주문할 수 있고, 하나의 상품을 여러 회원이 주문할 수 있다.
⑦ 회원이 상품을 주문하면 주문에 대한 주문번호, 주문수량, 배송지, 주문일자 정보를 유지해야 한다.

⑧ 각 상품은 한 제조업체가 공급하고, 제조업체 하나는 여러 상품을 공급할 수 있다.
⑨ 제조업체가 상품을 공급하면 공급일자와 공급량 정보를 유지해야 한다. (=저장하고 있어야한다) 입고관리
⑩ 제조업체에 대한 제조업체명, 전화번호, 위치, 담당자 정보를 유지해야 한다.(= 저장)
⑪ 제조업체는 제조업체명으로 식별한다.
⑫ 회원은 게시글을 여러 개 작성할 수 있고, 게시글 하나는 한 명의 회원만 작성할 수 있다. -- 비회원?
⑬ 게시글에 대한 글번호, 글제목, 글내용, 작성일자 정보를 유지해야 한다.
⑭ 게시글은 글번호로 식별한다.

길고 상세하게
양식 상관없음
--------------------------------------------------------------------------------
6. DB 모델링 단계 ( 2 ) 개념적 DB 모델링 -> [ ERD ] 작성.

1. 개념적 데이터 베이스 모델링이란 ?
   데이터 베이스 모델링을 함에 있어 가장 먼저 해야될 일은 사용자가 필요로 하는 데이터가 무엇이며
                            어떤 데이터를 데이터베이스에 담아야 하는 지에 대한 충분한 분석이다.
   이러한 것들은 업무 분석, 사용자 요구 분석 등을 통해 얻어지며 수집된 현실 세계의 정보들을 사람들이 이해할 수 있는 
   명확한 형태로 표현하는 단계를 '개념적 데이터베이스 모델링'이라고 한다.

2. ER-Diagram
   현실 세계를 좀 더 명확히 표현하기 위한 여러 방법 중 가장 널리 사용되고 있는 개체(E)-관계(R) 모델을 이용해
   개념적 데이터베이스 모델링에 대해 알아보자.

3. E-R Model
 1) 1976년 P.Chen이 제안한 것.
 2) 개체 관계 모델을 그래프 형식으로 알아보기 쉽게 표현한 것.
    개체 - 직사각형,
    속성 - 타원형,
    개체들 간의 관계 - 마름모
    이들을 연결하는 링크로 구성됨.(실선)
    식별자 밑줄

 3) 예 ( 학생과 과정 관계를 표현한 ER-Diagrm)

   학생(사) - 학번(타) 식별자속성    - 전화번호(타) - 이름(타)
      ↕
   등록(마) 다대다 관계(N:M)
       ↕
   과정(사) - 과정코드(타)식별자속성     - 과정명(타) - 과정내용(타)

4. ER - Diagrm 의 용어 - 이대로 찾아야함
   1) 실체(Entity)
   2) 속성(Attribute)
   3) 식별자(Identifier)
   4) 관계(Relational)

   
   4-1.   실체(Entity)
   1) 업무 수행을 위해 데이터로 관리되어져야 하는 사람,사물,장소,사건 등을 '실체'라 한다.
      이 때 구축하고자 하는 업무의 목적과 범위,전략에 따라 데이터로 관리되어져야 하는 항목을 파악하는 것이 매우 중요. / 업무별로 엔터티 생성 여부 결정/ 엔터티가 안되면 -> 속성으로 들어감
        -- emp의 job칼럼.. 정규화 거쳤다면 결과 같겠지만, 요구분석에 따름
   2) 실체는 학생,교수 등과 같이 물리적으로 존재하는 유형
      과목,학과 등과 같이 개념적으로 존재하는 대상이 될 수 있다.
   3) 실체는 테이블로 정의된다.
   4) 실체는 인스턴스라 불리는 개별적인 객체들의 집합이다.
    예) 과목 : 자료 구조, 데이터베이스, 프로그래밍 등의 인스턴스들의 집합.
        학과 : 컴퓨터공학과, 전자공학, 국어교육학과 등의 인스턴스들의 집합.
   5) 실체를 파악하는 요령 
    - 관련 업무에 대한 지식( 가장 중요 )
    예)
     학원에서는 학생들의 출결상태와 성적들을 과목별로 관리하기를 원하고 있다.. (라고 업무 분석한 내용)
     - 실체(명사들 파악) : 학원(체인점이 아니라면 뺀다 ), 학생, 출결상태,성적, 과목 -- 테이블 5개
   -  각종 서류를 이용해서 실체 파악하는 것도 좋은 방법이다. 

   4-2.   속성(Attribute)
   1) 속성이란 ? 저장할 필요가 있는 실체에 대한 정보.
      즉, 속성은 실체의 성질, 분류, 수량, 상태, 특성, 특징 등을 나타내는 세부 항목을 의미한다. 
   2) 속성 설정 시 가장 중요한 부분은 관리의 목적과 활용 방향에 맞는 속성의 설정이다.
   3) 속성의 숫자는 10개 내외로 하는 것이 좋다. 많아도 상관없음
   4) 속성은 컬럼으로 정의된다.(논리적 모델링에서)
   예)
   학생이란 실체의 속성 ? 업무프로세스에 따라 달라짐.
          학번, 이름, 주민번호, 전화번호,주소...
   사원이란 실체의 속성 ?
         사원번호, 사원명, 주민번호, 전화번호, 주소, 입사일자, 퇴사일자, 부서명...
   5) 속성의 유형
      (1) 기초 속성 : 원래 갖고 있는 속성
      (2) 추출 속성 : 기초 속성으로 가공처리(계산)를 해서 얻어질 수 있는 속성/ 나이 - 성능을 위해 만들어두고 매년 업데이트하기도 함. 
                    자료의 중복성,무결성 확보를 위해 최소화시키는 것이 바람직하다.
      (3) 설계 속성 : 실제로 존재하지는 않으나 시스템의 효율성,(+고객 만족)을 위해 설계자가 
                    임의로 부여하는 속성. / 배송상황. 실제로는 필요하지도 않음
   예)
   주문 Entity
   주문번호   고객   주문상품   주문일자   단가   수량   주문총금액   주문상태
   1   홍길동   H302   0204   10000   3   600000      1
   2   홍길동   H302   0204   10000   3   600000      1
   3   홍길동   H302   0204   10000   3   600000      1

   여기서)    추출속성 : 주문총금액 = 단가 * 수량    / 안만드는게 좋음
      설계속성 : 주문상태( 주문의 진행 상태:주문,결제완료,배송완료,취소) 확인 위한 속성

   [쇼핑몰의 주문 프로세스]  
    주문->취소->주문처리 완료
        ->결제완료 -> 배송완료 -> 주문처리 완료.

   6) 속성 도메인의 설정
    - 속성이 가질 수 있는 값들의 범위, 다시 말해 속성에 대한 세부적인 업무 , 제약조건 및 특성을 
      전체적으로 정의해 주는 것을 '속성의 도메인 설정'이라 한다.
    - 도메인 설정은 추후 개발 및 실체를 데이터베이스로 생성할 때나 프로그램 구현 시 유용하게 사용하는 산출물이다.
    - 도메인 정의 시에는 속성의 이름, 자료의 형태, 길이, 형식, 허용되는 값의 제약 조건, 유일성(Unique), 널 여부,
      유효값,초기값들의 사항을 파악해주면 된다. 
    - 도메인 무결성. : 데이터의 입력 형식이나 입력값등을 정의함으로써
             잘못된 데이터가 입력되는 경우의 수를 방지    하기위해 설정하는 것. 

   4-3.   식별자(Identifier)
   1) 식별자란?
      한 실체 내에서 각각의 인스턴스를 유일(Unique)하게 구분할 수 있는 단일 속성 또는 속성 그룹. 실체 무결성.
      학생(실체) - 학번
   2) 식별자가 없으면 데이터를 수정/삭제 못한다.
      그래서 모든 실체는 반드시 하나 이상의 식별자를 보유해야하며 또한 여러 개의 식별자를 보유할 수 있다.
   3) 식별자의 종류
      (1) 후보키(Candidate Key)
         실체에서 각각의 인스턴스를 구분할 수 있는 속성( 사원번호,주민번호) 
      예) 사원 - [사원번호], [주민번호], 사원명, 부서,주소
          
      (2) 기본키(Primary Key)
         후보키 중 가장 적합한 키. ( 사원번호 )
         - 해당 실체를 대표할 수 있나? 업무적으로 활용도가 높나? 길이가 짧나? 등등의 만족하는 후보키 중 하나 선택.
         ( 중요 )
           기본키는 not null, no duplicate(중복성),unique,clusterd index 설정됨.

      (3) 대체키(Alternate Key)
         후보키 중 기본키로 설정되지 않은 속성( 주민번호 )
         - index(인덱스)로 활용됨. 

      (4) 복합키(Composite Key)
         하나의 속성으로 기본키가 될 수 없는 경우 둘 이상의 컬럼을 묶어서 식별자로 정의한 경우.
         - 복합키 구성시 고려사항. : 복합키 중 어떤 컬럼을 먼저 둘것이냐? 
            이유: 복합키 중 먼저오는 컬럼에 index,unique가 적용되기에 성능 고려 때문.
      예) 급여 내역 실체
      급여지급일   사번    지금일자   급여액
      200901      1   30   10000   
      200901      2   30   10000   
      200902      1   30   10000   
      200902      2   30   10000   
      
      위의 기본키는 ? 없다. 
      복합키 : 급여지급일 + 사번 
      고려할 점 ) 어떠한 컬럼(속성)을 먼저 둘까? 
         - 조회의 경우 : 사번, 급여지급일 중 어느 컬럼으로 조회가 많나? 
         - 조회수가 비슷하다면 데이터의 입력 순서로 결정 : 당연 급여지급일자  우선 
            ( 아마 입력은 년/월/일 지급일자 순으로 계속 저장 될 것이다...)


      (5) 대리키(Surrogate Key:서러게이트)
         - 식별자가 너무 길거나 여러 개의 복합키로 구성되어 있는 경우 인위적으로 추가한 식별자(인공키).
         - 이것도 역정규화 작업이다. 
      예) 급여 내역 실체
      일련번호   급여지급일   사번    지금일자   급여액
      1         200901      1       30      10000   
      2         200901      2       30      10000   
      3         200902      1       30      10000   
      4         200902      2       30      10000   
   
      - 일련번호라는 대리키를 추가해서 식별자로 사용. ( 성능,효율성 때문에 ) 

   4-4.   관계(Relational)
   - 관계란? 업무의 연관성이다.  실체를 정의하다보면 서로 연관되는 실체들이 있다. 
   예)
   비디오테이프      회원
   관계) 
      [대여관계]
      회원은 비디오테이프를 대여한다.
             비디오테이프는 회원에게 대여된다.
      [가르침관계]
      학생은 교수에게 가르침을받는다.
      교수는 학생을 가르친다.

   - 관계 표현(부여)
   
      회원(사)    실선   대여(마)  실선   비디오(사)
      1) 관계가 있는 두 실체를 실선으로 연결하고 관계를 부여한다.
     2) 관계 차수를 표현한다. ( 1:1, 1:N, N:M관계)
     3) 선택성을 표시한다. 

   4-4-1) 관계 차수
      1) 1:1 관계
       각각의 부서와 관리하는 부서장과의 관계.
 
      1) 1:N 관계
       각각의 부서와 사원과의 관계

      1) N:M 관계
        고객과 상품 실체 간에는 주문이라는 관계. 
       ( 한 고객은 여러 상품을 주문할 수 있고, 한 상품은 여러 고객에게 주문될 수 있다.)

       다대다 관계는 여러 문제점 때문에
         논리적 데이터베이스 모델링 단계를 거치면서 1:N 관계로 바꾼다. /개념적 모델링까지 다 대 다

      실제 데이터베이스는 1:1과 1:다 관계만 존재한다. 

[문제1] 다음은 현업 담담자와의 면담 자료이다.( 요구 분석 )
지금까지 알아본 개념을 바탕으로 다음에서 실체와 주요 속성을 추출해 다이어 그램을 그리시오.

나는 교육센터의 관리자이다 우리는 여러 과정을 가르치는 데, 각 과정은 코드,이름 및 수강료를 갖고 있다. 
'VB'과 'Java' 는 인기 있는 과정이다. 과정들은 1일~4일간으로 기간은 다양하다. 박찬호와 박신양은 우리의 가장 
훌륭한 강사들이다. 우리는 각 강사의 이름과 전화번호를 필요로 한다. 학생들은 시간에 따라 여러 개의 과정을 이수할 수 있는 데 
많은 학생들이 이렇게 하고 있다. 우리는 각 학생들의 이름과 전화번호를 알고 싶다. 
--------------------------------------------------------------------------------
7.  DB 모델링 단계 ( 3단계 ) 논리적 DB 모델링 ( 논리적 스키마 생성, 정규화 )
    1) E-R다이어그램 -> 릴레이션(테이블) 스키마로 변환
                (5가지 규칙) 완벽하지 않을 수 있음. 이상현상
        
        이상현상 제거
    2) 정규화
    규칙1: 모든 개체는 릴레이션으로 변환한다 / 실체 = 테이블, 속성 = 칼럼. 식별자 -> PK
    규칙2: 다대다(n:m) 관계는 릴레이션으로 변환한다. 관계도 테이블로 만들어진다

--------------------------------------------------------------------------------
ㄱ. 정규화 ? 이상 현상이 발생하지 않도록 하려면,
           관련 있는 속성들로만 릴레이션을 구성해야 하는데 
           이를 위해 필요한 것이 정규화
           
ㄴ. 함수적 종속성(FD;Functional Dependency) ?    속성들 간의 관련성    -> 관련없는 것 분리
   함수적 종속 ? 
   emp 테이블
   empno(PK) ename    ename(Y)은 empno(X)에 함수적으로 종속된다.
      X       Y
    결정자    종속자
      X  →  Y       (표기)
   
   empno -> ename
   empno -> hiredate
   empno -> job
   
   empno -> (ename, job, mgr, hiredate, sal ,comm, deptno )
      
   SELECT *    
   FROM emp;
   (1) 완전 함수적 종속
       여러 개의 속성이 모여서 하나의 기본키(PK)를 이룰 때   == 복합키
       복합키 전체에 어떤 속성이 종속적일 때 "완전 함수적 종속"이라고 한다. 
       예)
       (고객ID + 이벤트번호)    ->    당첨여부
       
   (2) 부분 함수적 종속 ( 복합키 ) 
       완전 함수 종속이 아니면 "부분 함수적 종속" 이라고 한다. 
        예)
       (고객ID + 이벤트번호)    ->    고객이름  X
        고객ID    ->    고객이름 
             
   (3) 이행 함수적 종속
     Y는 X에 함수적 종속이다.
     결정자 종속자       결정자     종속자
      X      ->  Y          Y     ->   Z          일때    X  ->    Z
     empno   -> deptno    deptno -> dname 
     사원번호  사원명  부서번호  부서명 
      

--------------------------------------------------------------------------------
[ BCNF 정규화 ]
복합키
  A     ->      C       완전함수적종속
    [B] <-      C       함수적종속
    
    A   C
    
    C   B

--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------































